In [13]:
import numpy as np
import pandas as pd

In [15]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [16]:
df = pd.DataFrame(d)

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [20]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [23]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [26]:
df.fillna(value='yo')

    A   B  C
0   1   5  1
1   2  yo  2
2  yo  yo  3

In [28]:
df['B']

0    5.0
1    NaN
2    NaN
Name: B, dtype: float64

In [34]:
df['B'].fillna(df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [67]:
d = pd.DataFrame({'Company' :['google', 'google', 'FB', 'FB', 'yahoo'],
      'Person':['sam', 'pam', 'moni', 'roni', 'michelle'],
       'sales': [200, 100, 300, 200, 500]})

In [68]:
d

  Company    Person  sales
0  google       sam    200
1  google       pam    100
2      FB      moni    300
3      FB      roni    200
4   yahoo  michelle    500

  Company    Person  sales
0  google       sam    200
1  google       pam    100
2      FB      moni    300
3      FB      roni    200
4   yahoo  michelle    500

In [60]:
df.groupby('Company').count().loc['FB']

Person    2
sales     2
Name: FB, dtype: int64

In [62]:
df.groupby('Company').max().loc['FB']

Person    roni
sales      300
Name: FB, dtype: object

In [64]:
df.groupby('Company').describe().transpose()

Company              FB      google  yahoo
sales count    2.000000    2.000000    1.0
      mean   250.000000  150.000000  500.0
      std     70.710678   70.710678    NaN
      min    200.000000  100.000000  500.0
      25%    225.000000  125.000000  500.0
      50%    250.000000  150.000000  500.0
      75%    275.000000  175.000000  500.0
      max    300.000000  200.000000  500.0

In [101]:
df = pd.DataFrame({'A':[20,20,20],
                    'B':[40,50,60],
                    'C':[70,80,70],
                    'D':['hi','hello','hey']})

In [102]:
df

    A   B   C      D
0  20  40  70     hi
1  20  50  80  hello
2  20  60  70    hey

In [103]:
df['A'].nunique()

1

In [104]:
df['B'].value_counts()

60    1
50    1
40    1
Name: B, dtype: int64

In [105]:
df['D'].apply(len)

0    2
1    5
2    3
Name: D, dtype: int64

In [106]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [108]:
df.sort_values('C')

    A   B   C      D
0  20  40  70     hi
2  20  60  70    hey
1  20  50  80  hello